---
kind: method
id: M:Autodesk.Revit.DB.SelectionFilterElement.GetElementIds
source: html/42b70399-d151-8a68-8df6-546492c7091d.htm
---
# Autodesk.Revit.DB.SelectionFilterElement.GetElementIds Method

Returns the set of ElementIds contained by this filter.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetElementIds()
```

## Returns
The set of ElementIds.